backend/app/controllers/history_controller.rb

SELECT "users".* FROM "users" WHERE "users"."userID" = ? LIMIT ?  [["userID", 1], ["LIMIT", 1]]
---
    def set_user
      @user = User.find(params[:id])