backend/app/controllers/transactions_controller.rb

  def index
    respond_to do |format|
      if @user
        @transactions = @user.transactions
        format.html { render :index }
        format.json { render json: @transactions }
      else
        @transactions = Transaction.all
---
SELECT "transactions".* FROM "transactions"