backend/app/controllers/users_controller.rb

    def set_user
      @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."userID" = ? LIMIT ?  [["userID", 1], ["LIMIT", 1]]